{
    "layout": "speaker.njk",
    "page": {
        "title": "ServerlessDays Cardiff - Luke Hedger",
        "description": "Luke Hedger is a seasoned software engineer, AWS Community Builder and co-author of Serverless Development on AWS (O’Reilly, 2024). He has worked at all layers of the software stack, building backend applications and state-of-the-art React apps, blockchain networks and viral marketing websites, open source tools and a pineapple delivery system. Luke has been leading engineering teams since 2018 and believes we are only just beginning to unlock the full potential of cloud-native patterns like serverless workflow orchestration and event-driven architecture.",
        "url": "https://cardiff.serverlessdays.io/speakers/luke",
        "image": "https://res.cloudinary.com/dod4lcj3h/image/upload/v1721936742/serverlessdays/LukeHedger_jhsy5t.jpg"
    },
    "speaker": {
        "name": "Luke Hedger",
        "title": "Lead Engineer and AWS Community Builder",
        "img": "https://res.cloudinary.com/dod4lcj3h/image/upload/v1721936742/serverlessdays/LukeHedger_jhsy5t.jpg",
        "bio": "Luke Hedger is a seasoned software engineer, AWS Community Builder and co-author of Serverless Development on AWS (O’Reilly, 2024). He has worked at all layers of the software stack, building backend applications and state-of-the-art React apps, blockchain networks and viral marketing websites, open source tools and a pineapple delivery system. Luke has been leading engineering teams since 2018 and believes we are only just beginning to unlock the full potential of cloud-native patterns like serverless workflow orchestration and event-driven architecture.",
        "talk": {
            "title": "What are you waiting for?",
            "abstract" : "Asynchronous systems certainly seem tricky to test. Compute and storage are distributed across managed services, and even across regions or accounts. These managed services are difficult to emulate and run locally. And, perhaps most difficult of all, communication across these distributed services is often event-driven and temporal. \n\r But what if we told you there was another way and that asynchronous testing can be a catalyst rather than a constraint? In this talk, we will share a proven approach to testing asynchronous, event-driven architectures that have helped to build reliable, high-quality, enterprise-scale software. \n\r We will walk through a typical asynchronous workflow and design a minimal yet effective test strategy. \n\r Finally, we will introduce you to your new favourite framework for reliability. You’ll be equipped to adopt this framework in your team and start to continuously aim for a harmonious balance between delivery, testing, observability and recovery."
        },
        "social": [
            {
                "name": "Twitter",
                "link": "https://twitter.com/level_out",
                "icon": "https://res.cloudinary.com/serverlessdays/image/upload/v1560336697/Twitter.svg"
            }
        ],
        "links": [
            {
                "text": "",
                "link": ""
            }
        ]
    }
  }