{
    "layout": "speaker.njk",
    "page": {
        "title": "ServerlessDays Cardiff - Natasha McCann",
        "description": "Tash is a Senior Solutions Architect at AWS, acting as a technical advisor to Central Government customers in the UK. She joined from a non tech background into tech a decade ago, self-learning programming and the cloud, starting from working on an IT ServiceDesk, to developer, to Solutions Architect. She specialises in Data and Analytics, with deep domain expertise in data pipelines, data warehousing and transactional data lakes, also leading an internal SME program in EMEA for Amazon Redshift. Tash has spoken at conferences around the world, speaking at re:invent, a few AWS Summits and some open-source meetups. Outside of work, I love spending time with my pets, especially my two cats Bertie and Ernie.",
        "url": "https://cardiff.serverlessdays.io/speakers/tash",
        "image": "https://res.cloudinary.com/dod4lcj3h/image/upload/v1722025176/serverlessdays/NatashaMcCann_tkfli2.jpg"
    },
    "speaker": {
        "name": "Natasha McCann",
        "title": "Senior Solutions Architect, AWS",
        "img": "https://res.cloudinary.com/dod4lcj3h/image/upload/v1722025176/serverlessdays/NatashaMcCann_tkfli2.jpg",
        "bio": "Tash is a Senior Solutions Architect at AWS, acting as a technical advisor to Central Government customers in the UK. She joined from a non tech background into tech a decade ago, self-learning programming and the cloud, starting from working on an IT ServiceDesk, to developer, to Solutions Architect. She specialises in Data and Analytics, with deep domain expertise in data pipelines, data warehousing and transactional data lakes, also leading an internal SME program in EMEA for Amazon Redshift. Tash has spoken at conferences around the world, speaking at re:invent, a few AWS Summits and some open-source meetups. Outside of work, I love spending time with my pets, especially my two cats Bertie and Ernie.",
        "talk": {
            "title": "Building a Zero-ETL Data Pipeline on AWS",
            "abstract" : "The most impactful, data-driven insights come from getting a full picture of your business and customers. This can only be achieved when you connect the dots between your different data sources. With data spread across multiple departments, services, databases, and third-party applications, you need to be able to easily connect to data across silos to get the best insights. Typically, connecting data across different data silos requires complex extract, transform, and load (ETL) pipelines, which can take hours, if not days. That’s just not fast enough to keep up with the speed of decision making. Come learn how AWS is investing in a zero-ETL future so you can quickly and easily connect to and act on all your data across ingestion, analytics, machine learning, and business intelligence as well as third party data. With direct integrations between AWS services, we are eliminating ETL for common use cases so teams can move faster."
        },
        "social": [
            {
                "name": "Twitter",
                "link": "https://twitter.com/tashcodes",
                "icon": "https://res.cloudinary.com/serverlessdays/image/upload/v1560336697/Twitter.svg"
            },
            {
                "name": "LinkedIn",
                "link": "https://www.linkedin.com/in/natasha-mccann-7b5851102",
                "icon": "https://res.cloudinary.com/serverlessdays/image/upload/c_scale,h_80/v1560755840/linkedin_white.png"
            }
        ],
        "links": [
            {
                "text": "",
                "link": ""
            }
        ]
    }
  }